Revit 2027 API
Material.Color Property
 The color of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
public:
property Color^ Color {
	Color^ get ();
	void set (Color^ value);
}
member Color : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace